* steno
  :PROPERTIES:
  :CUSTOM_ID: steno
  :END:

steno is a personal project to digitize my stenographic writings.

** Tasks

*** DONE convert a jpg image in a binary image
    CLOSED: [2018-08-30 Jo 12:06] SCHEDULED: <2018-08-28 Ma>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2018-08-30 Jo 12:06]
    CLOCK: [2018-08-28 Ma 13:08]--[2018-08-28 Ma 13:33] =>  0:25
    :END:
*** DONE visualize  a binary image
    CLOSED: [2018-08-30 Jo 15:46] SCHEDULED: <2018-08-30 Jo>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2018-08-30 Jo 15:46]
    CLOCK: [2018-08-30 Jo 12:06]--[2018-08-30 Jo 12:31] =>  0:25
    :END:
*** DONE extract steno words from image and normalize them
    CLOSED: [2018-09-05 Mi 12:17] SCHEDULED: <2018-09-01 Sb>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2018-09-05 Mi 12:17]
    CLOCK: [2018-09-04 Ma 12:00]--[2018-09-04 Ma 12:02] =>  0:02
    CLOCK: [2018-09-03 Lu 13:33]--[2018-09-03 Lu 13:58] =>  0:25
    CLOCK: [2018-09-03 Lu 13:01]--[2018-09-03 Lu 13:26] =>  0:25
    :END:
*** DONE visualize steno words
    CLOSED: [2018-09-29 Sb 13:20] SCHEDULED: <2018-09-05 Mi>
    :LOGBOOK:
    - State "DONE"       from "STARTED"    [2018-09-29 Sb 13:20]
    CLOCK: [2018-09-16 Du 16:41]--[2018-09-16 Du 16:58] =>  0:17
    CLOCK: [2018-09-16 Du 01:59]--[2018-09-16 Du 02:25] =>  0:26
    CLOCK: [2018-09-15 Sb 20:53]--[2018-09-15 Sb 21:18] =>  0:25
    CLOCK: [2018-09-15 Sb 18:51]--[2018-09-15 Sb 19:16] =>  0:25
    CLOCK: [2018-09-15 Sb 16:16]--[2018-09-15 Sb 16:41] =>  0:25
    :END:
*** TODO clean image
    SCHEDULED: <2018-09-29 Sb>

*** TODO implement a compressed format for steno words
*** TODO build a db with steno words



** License

Copyright © 2018 Dan Pomohaci

This project is licensed under the terms of the  Eclipse License 1.0.
